In [19]:
import pandas as pd
from pandas import ExcelWriter
from pandas import ExcelFile
import numpy as np
df = pd.read_excel('/home/aasif/Desktop/dataanalysis/example.xlsx')
df.head()

    Fruit  Yellow  Sweet  Long  Total
0   Mango     350    450     0    800
1  Banana     400    300   350   1050
2   Other      50    100    50    200
3   Total     800    850  1200   2050

In [2]:
print("columns Headings : ")
print(df.columns)

columns Headings :
Index(['Fruit', 'Yellow', 'Sweet', 'Long', 'Total'], dtype='object')

In [3]:
print(df['Yellow'])

0    350
1    400
2     50
3    800
Name: Yellow, dtype: int64

In [4]:
for i in df.index:
    print(df['Sweet'][i])

450
300
100
850

In [5]:
l1=df['Long']
print(l1[1])

350

In [24]:
df.loc[0]

Fruit     Mango
Yellow      350
Sweet       450
Long          0
Total       800
Name: 0, dtype: object

In [56]:
df.iloc[0]

Fruit     Mango
Yellow      350
Sweet       450
Long          0
Total       800
Name: 0, dtype: object

In [51]:
df.iloc[0:1]

   Fruit  Yellow  Sweet  Long  Total
0  Mango     350    450     0    800

In [75]:
df.iloc[0:3]

    Fruit  Yellow  Sweet  Long  Total
0   Mango     350    450     0    800
1  Banana     400    300   350   1050
2   Other      50    100    50    200

In [58]:
df.iloc[0:3, 0:1]

    Fruit
0   Mango
1  Banana
2   Other

In [80]:
df.iloc[0:1,1:2]

   Yellow
0     350

In [93]:
p_of_M_or_Y = df.iloc[0,1]
print(p_of_M_or_Y)
print(type(p_of_M_or_Y))

350
<class 'numpy.int64'>

350
<class 'numpy.int64'>

In [88]:
y=df.iloc[3,1]
print(y)
print(type(y))

800
<class 'numpy.int64'>

In [91]:
m=df.iloc[3,4]
print(m)
print(type(m))

2050
<class 'numpy.int64'>

In [98]:
(p_of_M_or_Y/y)*(y/m)/(y/m)

0.4375